TMS320C2000 Assembler PC v22.6.1 Thu Mar 28 17:35:25 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui_scicomms_driverlib.asm                                      PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.1.LTS *
       3              ;* Date/Time created: Thu Mar 28 17:35:24 2024                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=eabi --cla_support=cla2 --diag_wrap=off --float_support=fpu32 --hll_source=on --
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../libraries/sfra/sfra_gui_scicomms_driverlib.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Joel9\Downloads\llc_capstone_F28003\llc_capstone_F28003x\R
      13              
      14              ;**************************************************************
      15              ;* FUNCTION SYNONYMS                                          *

    5876                      .dwattr $C$DW$T$24, DW_AT_decl_file("C:/Users/Joel9/Downloads/llc_capstone_F28003/llc_capstone_F28003
    5877                      .dwattr $C$DW$T$24, DW_AT_decl_line(0x7e)
    5878                      .dwattr $C$DW$T$24, DW_AT_decl_column(0x01)
    5879                      .dwendtag $C$DW$T$24
    5880              
    5881                      .dwendtag $C$DW$TU$24
    5882              
    5883              
    5884              $C$DW$TU$25     .dwtag  DW_TAG_type_unit
    5885                      .dwmtype  $C$DW$T$25
    5886              $C$DW$T$25      .dwtag  DW_TAG_typedef
    5887                      .dwattr $C$DW$T$25, DW_AT_name("GPIO_Direction")
    5888                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    5889                      .dwattr $C$DW$T$25, DW_AT_decl_file("C:/Users/Joel9/Downloads/llc_capstone_F28003/llc_capstone_F28003
    5890                      .dwattr $C$DW$T$25, DW_AT_decl_line(0x81)
    5891                      .dwattr $C$DW$T$25, DW_AT_decl_column(0x03)
    5892              
    5893                      .dwendtag $C$DW$TU$25
    5894              
    5895              
    5896              $C$DW$TU$26     .dwtag  DW_TAG_type_unit
    5897                      .dwmtype  $C$DW$T$26
    5898              
    5899              $C$DW$T$26      .dwtag  DW_TAG_enumeration_type
    5900                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    5901              $C$DW$337       .dwtag  DW_TAG_enumerator
    5902                      .dwattr $C$DW$337, DW_AT_name("GPIO_QUAL_SYNC")
    5903                      .dwattr $C$DW$337, DW_AT_const_value(0x00)
    5904                      .dwattr $C$DW$337, DW_AT_decl_file("C:/Users/Joel9/Downloads/llc_capstone_F28003/llc_capstone_F28003x
    5905                      .dwattr $C$DW$337, DW_AT_decl_line(0x98)
    5906                      .dwattr $C$DW$337, DW_AT_decl_column(0x05)
    5907              
    5908              $C$DW$338       .dwtag  DW_TAG_enumerator
    5909                      .dwattr $C$DW$338, DW_AT_name("GPIO_QUAL_3SAMPLE")
    5910                      .dwattr $C$DW$338, DW_AT_const_value(0x01)
    5911                      .dwattr $C$DW$338, DW_AT_decl_file("C:/Users/Joel9/Downloads/llc_capstone_F28003/llc_capstone_F28003x
TMS320C2000 Assembler PC v22.6.1 Thu Mar 28 17:35:25 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui_scicomms_driverlib.asm                                      PAGE  115

    5912                      .dwattr $C$DW$338, DW_AT_decl_line(0x99)
    5913                      .dwattr $C$DW$338, DW_AT_decl_column(0x05)
    5914              
    5915              $C$DW$339       .dwtag  DW_TAG_enumerator
    5916                      .dwattr $C$DW$339, DW_AT_name("GPIO_QUAL_6SAMPLE")
    5917                      .dwattr $C$DW$339, DW_AT_const_value(0x02)
    5918                      .dwattr $C$DW$339, DW_AT_decl_file("C:/Users/Joel9/Downloads/llc_capstone_F28003/llc_capstone_F28003x
    5919                      .dwattr $C$DW$339, DW_AT_decl_line(0x9a)
    5920                      .dwattr $C$DW$339, DW_AT_decl_column(0x05)
    5921              
    5922              $C$DW$340       .dwtag  DW_TAG_enumerator
    5923                      .dwattr $C$DW$340, DW_AT_name("GPIO_QUAL_ASYNC")
    5924                      .dwattr $C$DW$340, DW_AT_const_value(0x03)
    5925                      .dwattr $C$DW$340, DW_AT_decl_file("C:/Users/Joel9/Downloads/llc_capstone_F28003/llc_capstone_F28003x
    5926                      .dwattr $C$DW$340, DW_AT_decl_line(0x9b)
    5927                      .dwattr $C$DW$340, DW_AT_decl_column(0x05)
    5928              
    5929                      .dwattr $C$DW$T$26, DW_AT_decl_file("C:/Users/Joel9/Downloads/llc_capstone_F28003/llc_capstone_F28003
    5930                      .dwattr $C$DW$T$26, DW_AT_decl_line(0x97)
    5931                      .dwattr $C$DW$T$26, DW_AT_decl_column(0x01)
    5932                      .dwendtag $C$DW$T$26
    5933              
    5934                      .dwendtag $C$DW$TU$26
    5935              
    5936              
    5937              $C$DW$TU$27     .dwtag  DW_TAG_type_unit
    5938                      .dwmtype  $C$DW$T$27
    5939              $C$DW$T$27      .dwtag  DW_TAG_typedef
    5940                      .dwattr $C$DW$T$27, DW_AT_name("GPIO_QualificationMode")
    5941                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    5942                      .dwattr $C$DW$T$27, DW_AT_decl_file("C:/Users/Joel9/Downloads/llc_capstone_F28003/llc_capstone_F28003
    5943                      .dwattr $C$DW$T$27, DW_AT_decl_line(0x9c)
    5944                      .dwattr $C$DW$T$27, DW_AT_decl_column(0x03)
    5945              
    5946                      .dwendtag $C$DW$TU$27
    5947              
    5948              
    5949              $C$DW$TU$23     .dwtag  DW_TAG_type_unit
    5950                      .dwmtype  $C$DW$T$23
    5951              
    5952              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    5953                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x20)
    5954              $C$DW$341       .dwtag  DW_TAG_member
    5955                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$20)
    5956                      .dwattr $C$DW$341, DW_AT_name("h_magVect")
    5957                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    5958                      .dwattr $C$DW$341, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    5959                      .dwattr $C$DW$341, DW_AT_decl_line(0x40)
    5960                      .dwattr $C$DW$341, DW_AT_decl_column(0x10)
    5961              
    5962              $C$DW$342       .dwtag  DW_TAG_member
    5963                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$20)
    5964                      .dwattr $C$DW$342, DW_AT_name("h_phaseVect")
    5965                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5966                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.1 Thu Mar 28 17:35:25 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui_scicomms_driverlib.asm                                      PAGE  116

    5967                      .dwattr $C$DW$342, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    5968                      .dwattr $C$DW$342, DW_AT_decl_line(0x41)
    5969                      .dwattr $C$DW$342, DW_AT_decl_column(0x10)
    5970              
    5971              $C$DW$343       .dwtag  DW_TAG_member
    5972                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$20)
    5973                      .dwattr $C$DW$343, DW_AT_name("gh_magVect")
    5974                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5975                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    5976                      .dwattr $C$DW$343, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    5977                      .dwattr $C$DW$343, DW_AT_decl_line(0x42)
    5978                      .dwattr $C$DW$343, DW_AT_decl_column(0x10)
    5979              
    5980              $C$DW$344       .dwtag  DW_TAG_member
    5981                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$20)
    5982                      .dwattr $C$DW$344, DW_AT_name("gh_phaseVect")
    5983                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5984                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    5985                      .dwattr $C$DW$344, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    5986                      .dwattr $C$DW$344, DW_AT_decl_line(0x43)
    5987                      .dwattr $C$DW$344, DW_AT_decl_column(0x10)
    5988              
    5989              $C$DW$345       .dwtag  DW_TAG_member
    5990                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$20)
    5991                      .dwattr $C$DW$345, DW_AT_name("cl_magVect")
    5992                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5993                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    5994                      .dwattr $C$DW$345, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    5995                      .dwattr $C$DW$345, DW_AT_decl_line(0x44)
    5996                      .dwattr $C$DW$345, DW_AT_decl_column(0x10)
    5997              
    5998              $C$DW$346       .dwtag  DW_TAG_member
    5999                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$20)
    6000                      .dwattr $C$DW$346, DW_AT_name("cl_phaseVect")
    6001                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6002                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    6003                      .dwattr $C$DW$346, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    6004                      .dwattr $C$DW$346, DW_AT_decl_line(0x45)
    6005                      .dwattr $C$DW$346, DW_AT_decl_column(0x10)
    6006              
    6007              $C$DW$347       .dwtag  DW_TAG_member
    6008                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$20)
    6009                      .dwattr $C$DW$347, DW_AT_name("freqVect")
    6010                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6011                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    6012                      .dwattr $C$DW$347, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    6013                      .dwattr $C$DW$347, DW_AT_decl_line(0x46)
    6014                      .dwattr $C$DW$347, DW_AT_decl_column(0x10)
    6015              
    6016              $C$DW$348       .dwtag  DW_TAG_member
    6017                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$19)
    6018                      .dwattr $C$DW$348, DW_AT_name("amplitude")
    6019                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6020                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    6021                      .dwattr $C$DW$348, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
TMS320C2000 Assembler PC v22.6.1 Thu Mar 28 17:35:25 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui_scicomms_driverlib.asm                                      PAGE  117

    6022                      .dwattr $C$DW$348, DW_AT_decl_line(0x47)
    6023                      .dwattr $C$DW$348, DW_AT_decl_column(0x0f)
    6024              
    6025              $C$DW$349       .dwtag  DW_TAG_member
    6026                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$19)
    6027                      .dwattr $C$DW$349, DW_AT_name("isrFreq")
    6028                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6029                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    6030                      .dwattr $C$DW$349, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    6031                      .dwattr $C$DW$349, DW_AT_decl_line(0x48)
    6032                      .dwattr $C$DW$349, DW_AT_decl_column(0x0f)
    6033              
    6034              $C$DW$350       .dwtag  DW_TAG_member
    6035                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$19)
    6036                      .dwattr $C$DW$350, DW_AT_name("freqStart")
    6037                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6038                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    6039                      .dwattr $C$DW$350, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    6040                      .dwattr $C$DW$350, DW_AT_decl_line(0x49)
    6041                      .dwattr $C$DW$350, DW_AT_decl_column(0x0f)
    6042              
    6043              $C$DW$351       .dwtag  DW_TAG_member
    6044                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$19)
    6045                      .dwattr $C$DW$351, DW_AT_name("freqStep")
    6046                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6047                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    6048                      .dwattr $C$DW$351, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    6049                      .dwattr $C$DW$351, DW_AT_decl_line(0x4a)
    6050                      .dwattr $C$DW$351, DW_AT_decl_column(0x0f)
    6051              
    6052              $C$DW$352       .dwtag  DW_TAG_member
    6053                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$22)
    6054                      .dwattr $C$DW$352, DW_AT_name("start")
    6055                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    6056                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    6057                      .dwattr $C$DW$352, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    6058                      .dwattr $C$DW$352, DW_AT_decl_line(0x4b)
    6059                      .dwattr $C$DW$352, DW_AT_decl_column(0x0d)
    6060              
    6061              $C$DW$353       .dwtag  DW_TAG_member
    6062                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$22)
    6063                      .dwattr $C$DW$353, DW_AT_name("state")
    6064                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    6065                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    6066                      .dwattr $C$DW$353, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    6067                      .dwattr $C$DW$353, DW_AT_decl_line(0x4c)
    6068                      .dwattr $C$DW$353, DW_AT_decl_column(0x0d)
    6069              
    6070              $C$DW$354       .dwtag  DW_TAG_member
    6071                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$22)
    6072                      .dwattr $C$DW$354, DW_AT_name("status")
    6073                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6074                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    6075                      .dwattr $C$DW$354, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    6076                      .dwattr $C$DW$354, DW_AT_decl_line(0x4d)
TMS320C2000 Assembler PC v22.6.1 Thu Mar 28 17:35:25 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui_scicomms_driverlib.asm                                      PAGE  118

    6077                      .dwattr $C$DW$354, DW_AT_decl_column(0x0d)
    6078              
    6079              $C$DW$355       .dwtag  DW_TAG_member
    6080                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$22)
    6081                      .dwattr $C$DW$355, DW_AT_name("vecLength")
    6082                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    6083                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    6084                      .dwattr $C$DW$355, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    6085                      .dwattr $C$DW$355, DW_AT_decl_line(0x4e)
    6086                      .dwattr $C$DW$355, DW_AT_decl_column(0x0d)
    6087              
    6088              $C$DW$356       .dwtag  DW_TAG_member
    6089                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$22)
    6090                      .dwattr $C$DW$356, DW_AT_name("freqIndex")
    6091                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    6092                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    6093                      .dwattr $C$DW$356, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    6094                      .dwattr $C$DW$356, DW_AT_decl_line(0x4f)
    6095                      .dwattr $C$DW$356, DW_AT_decl_column(0x0d)
    6096              
    6097              $C$DW$357       .dwtag  DW_TAG_member
    6098                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$22)
    6099                      .dwattr $C$DW$357, DW_AT_name("storeH")
    6100                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    6101                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    6102                      .dwattr $C$DW$357, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    6103                      .dwattr $C$DW$357, DW_AT_decl_line(0x50)
    6104                      .dwattr $C$DW$357, DW_AT_decl_column(0x0d)
    6105              
    6106              $C$DW$358       .dwtag  DW_TAG_member
    6107                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$22)
    6108                      .dwattr $C$DW$358, DW_AT_name("storeGH")
    6109                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6110                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    6111                      .dwattr $C$DW$358, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    6112                      .dwattr $C$DW$358, DW_AT_decl_line(0x51)
    6113                      .dwattr $C$DW$358, DW_AT_decl_column(0x0d)
    6114              
    6115              $C$DW$359       .dwtag  DW_TAG_member
    6116                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$22)
    6117                      .dwattr $C$DW$359, DW_AT_name("storeCL")
    6118                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    6119                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    6120                      .dwattr $C$DW$359, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    6121                      .dwattr $C$DW$359, DW_AT_decl_line(0x52)
    6122                      .dwattr $C$DW$359, DW_AT_decl_column(0x0d)
    6123              
    6124              $C$DW$360       .dwtag  DW_TAG_member
    6125                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$22)
    6126                      .dwattr $C$DW$360, DW_AT_name("speed")
    6127                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    6128                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    6129                      .dwattr $C$DW$360, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    6130                      .dwattr $C$DW$360, DW_AT_decl_line(0x53)
    6131                      .dwattr $C$DW$360, DW_AT_decl_column(0x0d)
TMS320C2000 Assembler PC v22.6.1 Thu Mar 28 17:35:25 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui_scicomms_driverlib.asm                                      PAGE  119

    6132              
    6133                      .dwattr $C$DW$T$23, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    6134                      .dwattr $C$DW$T$23, DW_AT_decl_line(0x3f)
    6135                      .dwattr $C$DW$T$23, DW_AT_decl_column(0x0f)
    6136                      .dwendtag $C$DW$T$23
    6137              
    6138                      .dwendtag $C$DW$TU$23
    6139              
    6140              
    6141              $C$DW$TU$28     .dwtag  DW_TAG_type_unit
    6142                      .dwmtype  $C$DW$T$28
    6143              $C$DW$T$28      .dwtag  DW_TAG_typedef
    6144                      .dwattr $C$DW$T$28, DW_AT_name("SFRA_F32")
    6145                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$23)
    6146                      .dwattr $C$DW$T$28, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    6147                      .dwattr $C$DW$T$28, DW_AT_decl_line(0x54)
    6148                      .dwattr $C$DW$T$28, DW_AT_decl_column(0x02)
    6149              
    6150                      .dwendtag $C$DW$TU$28
    6151              
    6152              
    6153              $C$DW$TU$29     .dwtag  DW_TAG_type_unit
    6154                      .dwmtype  $C$DW$T$29
    6155              $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    6156                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    6157                      .dwattr $C$DW$T$29, DW_AT_address_class(0x20)
    6158              
    6159                      .dwendtag $C$DW$TU$29
    6160              
    6161              
    6162              $C$DW$TU$30     .dwtag  DW_TAG_type_unit
    6163                      .dwmtype  $C$DW$T$30
    6164              $C$DW$361       .dwtag  DW_TAG_TI_far_type
    6165                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$29)
    6166              
    6167              $C$DW$T$30      .dwtag  DW_TAG_const_type
    6168                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$361)
    6169              
    6170                      .dwendtag $C$DW$TU$30
    6171              
    6172              
    6173              $C$DW$TU$2      .dwtag  DW_TAG_type_unit
    6174                      .dwmtype  $C$DW$T$2
    6175              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    6176                      .dwattr $C$DW$T$2, DW_AT_name("void")
    6177              
    6178                      .dwendtag $C$DW$TU$2
    6179              
    6180              
    6181              $C$DW$TU$51     .dwtag  DW_TAG_type_unit
    6182                      .dwmtype  $C$DW$T$51
    6183              
    6184              $C$DW$T$51      .dwtag  DW_TAG_subroutine_type
    6185                      .dwendtag $C$DW$T$51
    6186              
TMS320C2000 Assembler PC v22.6.1 Thu Mar 28 17:35:25 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui_scicomms_driverlib.asm                                      PAGE  120

    6187                      .dwendtag $C$DW$TU$51
    6188              
    6189              
    6190              $C$DW$TU$52     .dwtag  DW_TAG_type_unit
    6191                      .dwmtype  $C$DW$T$52
    6192              $C$DW$T$52      .dwtag  DW_TAG_pointer_type
    6193                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
